# 9095 참고
# 방법의 수를 1,000,000,009로 나눈 나머지를 출력한다.
# 메모리 초과 해결 (t의 값이 1000000까지 존재)

import sys

n = int(sys.stdin.readline())
dp = [0 for _ in range(1000001)]
dp[0], dp[1], dp[2], dp[3] = 0, 1, 2, 4

for i in range(4, 1000001):
    dp[i] = (dp[i-3] % 1000000009 + dp[i-2] %
             1000000009 + dp[i-1] % 1000000009)


for i in range(n):
    t = int(sys.stdin.readline())
    print(dp[t] % 1000000009)

'''
1 - 1개
2 - 2개
3 - 4개
4 - 7개

5 
1 1 1 1 1
1 1 1 2 / 1 1 2 1 / 1 2 1 1 / 2 1 1 1 
1 2 2 / 2 1 2 / 2 2 1
2 3 / 3 2
1 1 3 / 1 3 1 / 3 1 1
(13개)

6 
1 1 1 1 1 1 
1 1 1 1 2 / 1 1 1 2 1 / 1 1 2 1 1 / 1 2 1 1 1 / 2 1 1 1 1  
1 1 1 3 / 1 1 3 1 / 1 3 1 1 / 3 1 1 1 
1 1 2 2 / 1 2 2 1 / 2 2 1 1 / 2 1 1 2 / 2 1 2 1   
1 2 3 / 1 3 2 
2 1 3 / 2 3 1  
3 2 1 / 3 1 2 
3 3 
2 2 2    
(23개)   
'''
